{
    "experiences": [
        {
            "title": "Software Engineer",
            "subtitle": "Q3 Technologies",
            "workType": "Full-time",
            "workDescription": [
                "Maintained and enhanced Rail Help for 5 operators by building React + .NET Core components and fixing defects, preventing interruptions across 200+ daily train schedules and improving booking reliability for 50,000+ passengers.",
                "Developed React + Sitecore 9.3 modules (MVC, .NET Core/C#, Helix, Next.js) that improved content publishing speed by 32% and overall system performance by 25%.",
                "Integrated SonarQube in CI with Docker, Git, and Bitbucket; automated quality gates and reduced defects by 20%, cutting release time by 15%."
            ],
            "dateText": "10/2022 – 12/2024"
        },
        {
            "title": "Software Engineer",
            "subtitle": "Altudo",
            "workType": "Full-time",
            "workDescription": [
                "Led development of the Society for Neuroscience website using MVC and Sitecore integrations, improving publishing speed by 20% and reducing release time for new pages by 2 hours.",
                "Built a responsive Sitecore 10.2 site with React, .NET, and TypeScript; reduced frontend load time by 30% and met WCAG accessibility standards, increasing average session duration by 18%.",
                "Collaborated with QA and PMs in Agile to build modules, migrate content, and deliver updates for multiple clients on Sitecore and SQL Server, delivering 100% of projects on time."
            ],
            "dateText": "06/2021 – 10/2022"
        },
        {
            "title": "Software Engineering Intern",
            "subtitle": "Nvidia",
            "workType": "Internship",
            "workDescription": [
                "Developed a motion‑adaptive deinterlacing algorithm in C++, reducing visual artifacts by 35% and improving clarity across multiple video pipelines.",
                "Integrated CUDA‑based parallel processing into FFmpeg workflows, achieving 3× faster processing and enabling 60 FPS playback with 50% lower rendering latency.",
                "Executed 100+ test cycles on Linux with QA to validate pipelines, improving reliability by 25% and ensuring broadcast‑grade results."
            ],
            "dateText": "01/2021 – 06/2021"
        }
    ]
}